In [37]:
import pandas as pd

mds_prune_data = pd.read_csv("../../output/POP_STRATIFICATION/MDS_PRUNE_SNPS/MDS_merge2.mds", sep="\s+")
sample_race = pd.read_csv("../../output/POP_STRATIFICATION/MDS_ENCODE_RACES/racefile.txt", sep=" ")

fam_header = ["FID", "IID", "PID", "MID", "Sex", "P"]
output_fam = pd.read_csv("../../output/POP_STRATIFICATION/FORMATTING_EXCLUDE_OUTLIER_SAMPLES/HapMap_3_r3_13.fam", sep="\s+", names=fam_header)

Check race of output samples

In [38]:
sample_race["race"].value_counts()

race
EUR    310
ASN    177
AFR    169
OWN     67
AMR     22
Name: count, dtype: int64

In [40]:
race_output = output_fam.merge(sample_race, on=["IID", "FID"], how="left")
race_output["race"].value_counts()

race
OWN    67
EUR    49
Name: count, dtype: int64

In [44]:
output_fam

      FID      IID  PID  MID  Sex  P
0    1328  NA06989    0    0    2  2
1    1349  NA11843    0    0    1  1
2    1328  NA06984    0    0    1  2
3    1418  NA12275    0    0    2  1
4   13291  NA06986    0    0    1  1
..    ...      ...  ...  ...  ... ..
62   1347  NA11881    0    0    1  1
63   1362  NA11994    0    0    1  2
64   1454  NA12815    0    0    2  2
65   1346  NA12043    0    0    1  2
66   1375  NA12264    0    0    1  1

[67 rows x 6 columns]

Check samples remaining after appling threshold

Note: Samples having FID=0 (sample in 1KGP, not in HapMap) will not appear in output

In [60]:
mds_apply_thres = mds_prune_data.loc[((mds_prune_data["C1"] < -0.04) & (mds_prune_data["C2"] > 0.03))]
mds_merge_race = mds_apply_thres.merge(sample_race, on=["IID", "FID"], how="left")

mds_merge_race[mds_merge_race["FID"] != 0].loc[:,"race"].value_counts()

race
OWN    67
EUR    49
Name: count, dtype: int64

In [58]:
## Check FID of AMR sample
mds_merge_race[mds_merge_race["race"] == "AMR"]

,FID,IID,SOL,C1,C2,C3,C4,C5,C6,C7,C8,C9,C10,race
285,0,NA19648,0,-0.047562,0.047373,0.010575,-0.017567,0.006196,-0.003954,0.004319,-0.004812,-0.000766,-0.0024,AMR

In [43]:
## Check duplicate rows
sample_race[sample_race.duplicated("IID")].sort_values(by="IID")

       FID      IID race
110      0  NA06984  EUR
680   1328  NA06984  OWN
113      0  NA06986  EUR
682  13291  NA06986  OWN
678   1328  NA06989  OWN
..     ...      ...  ...
239      0  NA12828  EUR
242      0  NA12872  EUR
735   1459  NA12872  OWN
697   1463  NA12890  OWN
247      0  NA12890  EUR

[98 rows x 3 columns]